# SetName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransactionGroup..::..SetName Method
TransactionGroup Class See Also
---
Sets the transaction group's name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetName(
	string name
)
```

Visual Basic
---
```text
Public Sub SetName ( _
	name As String _
)
```

Visual C++
---
```text
public:
void SetName(
	String^ name
)
```

# ### Parameters
name
    Type: System..::..String A name for the transaction group.
# Remarks
Transaction group only needs a name if it is going to be assimilated at the end.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
TransactionGroup Class
Autodesk.Revit.DB Namespace